# **Advanced Machine Learning - Assignment 1**

Let's define the training dataset import function, fetching directly from the Github repo.

In [1]:
import pandas as pd

def import_training_dataset():
  urlFeatures = 'https://github.com/AlbezJelt/AML_Assignment1/raw/main/data/X_train.csv'
  urlLabels = 'https://github.com/AlbezJelt/AML_Assignment1/raw/main/data/y_train.csv'
  trainset = pd.read_csv(urlFeatures)
  labelset = pd.read_csv(urlLabels)
  return trainset, labelset

trainset, labelset = import_training_dataset()

Now we can explore the pandas datasets:

In [6]:
trainset.head()

   Unnamed: 0     latitude  ...  Private_room  Entire_home/apt
0           0     40.71239  ...             1                0
1           1  40696.00000  ...             1                0
2           2     40.62707  ...             0                0
3           3     40.77910  ...             0                1
4           4     40.75777  ...             1                0

[5 rows x 10 columns]

In [5]:
labelset.head()

   Unnamed: 0  price
0           0     65
1           1     57
2           2    225
3           3    175
4           4    125